Public Attributes | List of all members
API_AssemblySegmentSchemeData Struct Reference
Element Manager API
Represents a segment scheme. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_AssemblySegmentLengthTypeID  | lengthType
Segment length type.
double  | fixedLength
Use this if lengthType is APIAssemblySegment_Fixed.
double  | lengthProportion
Use this if lengthType is APIAssemblySegment_Proportional.
Detailed Description
Represents a segment scheme.
Member Data Documentation
◆ fixedLength
 API_AssemblySegmentSchemeData::fixedLength
Use this if lengthType is APIAssemblySegment_Fixed.
◆ lengthProportion
 API_AssemblySegmentSchemeData::lengthProportion
Use this if lengthType is APIAssemblySegment_Proportional.
◆ lengthType
 API_AssemblySegmentSchemeData::lengthType
Segment length type.